---
kind: enumMember
id: F:Autodesk.Revit.UI.ContextualHelpType.ContextId
enum: Autodesk.Revit.UI.ContextualHelpType
source: html/e69d3100-719b-7be4-9580-563207d68439.htm
---
# Autodesk.Revit.UI.ContextualHelpType.ContextId

Represents an Autodesk help context id, which will automatically be mapped to a URL in the Revit help system.